fixtures/demo-configuration/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <comment>Задолженность нашей организации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fixtures/demo-configuration/src/AccumulationRegisters/Взаиморасчеты/Forms/ТекущиеВзаиморасчеты/Module.bsl
&НаСервере
Процедура Заполнить()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВзаиморасчетыОстатки.Контрагент,
	                      |	ВзаиморасчетыОстатки.Валюта,
	                      |	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
	                      |ИЗ
	                      |	РегистрНакопления.Взаиморасчеты.Остатки КАК ВзаиморасчетыОстатки
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаОстатков.Добавить();
		НоваяСтрока.Контрагент = Выборка.Контрагент;
		НоваяСтрока.Валюта = Выборка.Валюта;
		Если Выборка.СуммаОстаток > 0 Тогда
			НоваяСтрока.НашДолг = Выборка.СуммаОстаток;
		Иначе
			НоваяСтрока.ДолгНам = Выборка.СуммаОстаток * -1;
		КонецЕсли;	
	КонецЦикла
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заполнить();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение( ,ТаблицаОстатков.НайтиПоИдентификатору(ВыбраннаяСтрока).Контрагент);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВыполнить()
	ТаблицаОстатков.Очистить();
	Заполнить();
КонецПроцедуры
